Kyderio/arduino_test/Arduino_package/hardware/boards.txt
menu.AutoUploadMode=* Auto Flash Mode
menu.EraseFlash=* Erase All Flash Memory
menu.StdLibInit=* Standard Lib
menu.UploadBaudrate=* Upload Speed

##############################################################
# PLEASE DO NOT PUT BOARDS ABOVE THE OFFICIAL AMEBA BOARDS! ##
##############################################################

# EV721FC0 (RTL8721FCM) #
EV721FC0.name=EV721FC0 (RTL8721FCM)
#EV721FC0.vid.0=0x0403
#EV721FC0.pid.0=0x6001

#EV721FC0.build.tarch=cortex-m55
EV721FC0.build.mcu=RTL8721F
EV721FC0.build.f_cpu=240000000L
EV721FC0.build.usb_product="EV721FC0"
EV721FC0.build.board=AMEBA
EV721FC0.build.core=ameba
EV721FC0.build.project=amebagreen2
EV721FC0.build.extra_flags=-mthumb -DCORE_RTL8721F -DBOARD_AMBGREEN2 {build.usb_flags} -DArduino_STD_PRINTF
EV721FC0.build.variant=rtl8721fcm

EV721FC0.upload.tool=ameba_tools
EV721FC0.upload.protocol=usb_serial
EV721FC0.upload.maximum_size=2015232
EV721FC0.upload.maximum_data_size=303072
EV721FC0.upload.use_1200bps_touch=false
EV721FC0.upload.wait_for_upload_port=false
EV721FC0.upload.native_usb=false
EV721FC0.upload.auto_mode=Disable
EV721FC0.upload.erase_flash=
EV721FC0.upload.speed=1500000

EV721FC0.menu.EraseFlash.Disable=Disable
EV721FC0.menu.EraseFlash.Disable.upload.erase_flash=
EV721FC0.menu.EraseFlash.Enable=Enable
EV721FC0.menu.EraseFlash.Enable.upload.erase_flash=--chip-erase

#EV721FC0.menu.AutoUploadMode.Disable=Disable
#EV721FC0.menu.AutoUploadMode.Disable.upload.auto_mode=Disable
#EV721FC0.menu.AutoUploadMode.Enable=Enable
#EV721FC0.menu.AutoUploadMode.Enable.upload.auto_mode=Enable

EV721FC0.menu.StdLibInit.Enable=Arduino_STD_PRINTF
EV721FC0.menu.StdLibInit.Enable.build.extra_flags=-mthumb -DCORE_RTL8721F -DBOARD_AMBGREEN2 {build.usb_flags} -DArduino_STD_PRINTF
EV721FC0.menu.StdLibInit.Enable.build.ldscript=ameba_img2.ld
EV721FC0.menu.StdLibInit.Disable=Disable
EV721FC0.menu.StdLibInit.Disable.build.extra_flags=-mthumb -DCORE_RTL8721F -DBOARD_AMBGREEN2 {build.usb_flags}
EV721FC0.menu.StdLibInit.Disable.build.ldscript=ameba_img2.ld

EV721FC0.menu.UploadBaudrate.1500000=1500000
EV721FC0.menu.UploadBaudrate.1500000.upload.speed=1500000
EV721FC0.menu.UploadBaudrate.921600=921600
EV721FC0.menu.UploadBaudrate.921600.upload.speed=921600


# EV721FL0 (RTL8721FLM) #
EV721FL0.name=EV721FL0 (RTL8721FLM)
#EV721FL0.vid.0=0x0403
#EV721FL0.pid.0=0x6001

#EV721FL0.build.tarch=cortex-m55
EV721FL0.build.mcu=RTL8721F
EV721FL0.build.f_cpu=240000000L
EV721FL0.build.usb_product="EV721FL0"
EV721FL0.build.board=AMEBA
EV721FL0.build.core=ameba
EV721FL0.build.project=amebagreen2
EV721FL0.build.extra_flags=-mthumb -DCORE_RTL8721F -DBOARD_AMBGREEN2 {build.usb_flags} -DArduino_STD_PRINTF
EV721FL0.build.variant=rtl8721flm

EV721FL0.upload.tool=ameba_tools
EV721FL0.upload.protocol=usb_serial
EV721FL0.upload.maximum_size=2015232
EV721FL0.upload.maximum_data_size=303072
EV721FL0.upload.use_1200bps_touch=false
EV721FL0.upload.wait_for_upload_port=false
EV721FL0.upload.native_usb=false
EV721FL0.upload.auto_mode=Disable
EV721FL0.upload.erase_flash=
EV721FL0.upload.speed=1500000

EV721FL0.menu.EraseFlash.Disable=Disable
EV721FL0.menu.EraseFlash.Disable.upload.erase_flash=
EV721FL0.menu.EraseFlash.Enable=Enable
EV721FL0.menu.EraseFlash.Enable.upload.erase_flash=--chip-erase

#EV721FL0.menu.AutoUploadMode.Disable=Disable
#EV721FL0.menu.AutoUploadMode.Disable.upload.auto_mode=Disable
#EV721FL0.menu.AutoUploadMode.Enable=Enable
#EV721FL0.menu.AutoUploadMode.Enable.upload.auto_mode=Enable

EV721FL0.menu.StdLibInit.Enable=Arduino_STD_PRINTF
EV721FL0.menu.StdLibInit.Enable.build.extra_flags=-mthumb -DCORE_RTL8721F -DBOARD_AMBGREEN2 {build.usb_flags} -DArduino_STD_PRINTF
EV721FL0.menu.StdLibInit.Enable.build.ldscript=ameba_img2.ld
EV721FL0.menu.StdLibInit.Disable=Disable
EV721FL0.menu.StdLibInit.Disable.build.extra_flags=-mthumb -DCORE_RTL8721F -DBOARD_AMBGREEN2 {build.usb_flags}
EV721FL0.menu.StdLibInit.Disable.build.ldscript=ameba_img2.ld

EV721FL0.menu.UploadBaudrate.1500000=1500000
EV721FL0.menu.UploadBaudrate.1500000.upload.speed=1500000
EV721FL0.menu.UploadBaudrate.921600=921600
EV721FL0.menu.UploadBaudrate.921600.upload.speed=921600